def sweep_method(a, b, c, d):
    n = len(d)
    p = [0]*(n)
    q = [0]*(n)
    x = [0]*(n)

    #Прямой проход
    p[0] = -c[0] / b[0]
    q[0] = d[0] / b[0]
    for i in range(1, n):
        p[i] = -c[i] / (b[i] + (a[i] * p[i-1]))
        q[i] = (d[i] - (a[i] * q[i-1])) / (b[i] + (a[i] * p[i-1]))

    #Обратный проход
    x[-1] = q[-1]
    for i in range(n-2, -1, -1):
        x[i] =  p[i] * x[i+1] + q[i]

    return x

a = ([0, -9, 1, -7, 6])
b = ([-14, 15, -11, 12, -7])
c = ([-6, -1, 1, 3, 0])
d = ([-78, -73, -38, 77, 91])

# Решение системы линейных уравнений
x = sweep_method(a, b, c, d)
print("Решение СЛАУ:")
print("x = (",  *x, ")")

